MikroElektronika/core_packages/PIC/XC8/def/PIC16LF707/mcu.h
// Register: FSR
#define FSR FSR
extern volatile unsigned char           FSR                 __at(0x004);
#ifndef _LIB_BUILD
asm("FSR equ 04h");
#endif

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0x005);
#ifndef _LIB_BUILD
asm("PORTA equ 05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
    struct {
        unsigned AN0                    :1;
        unsigned AN1                    :1;
        unsigned AN2                    :1;
        unsigned AN3                    :1;
        unsigned                        :1;
        unsigned AN4                    :1;
        unsigned OSC2                   :1;
        unsigned OSC1                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned CPSA0                  :1;
        unsigned CPSA1                  :1;
        unsigned CPSA2                  :1;
        unsigned CPSA3                  :1;
        unsigned CPSA4                  :1;
        unsigned CPSB1                  :1;
        unsigned CPSB0                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACOUT                 :1;
        unsigned                        :1;
        unsigned T0CKI                  :1;
        unsigned                        :1;
        unsigned CLKOUT                 :1;
        unsigned CLKIN                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TACKI                  :1;
    };
} PORTAbits_t;
extern volatile PORTAbits_t PORTAbits __at(0x005);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_RA7_POSN                                     0x7
#define _PORTA_RA7_POSITION                                 0x7
#define _PORTA_RA7_SIZE                                     0x1
#define _PORTA_RA7_LENGTH                                   0x1
#define _PORTA_RA7_MASK                                     0x80
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x3
#define _PORTA_AN3_POSITION                                 0x3
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x8
#define _PORTA_AN4_POSN                                     0x5
#define _PORTA_AN4_POSITION                                 0x5
#define _PORTA_AN4_SIZE                                     0x1
#define _PORTA_AN4_LENGTH                                   0x1
#define _PORTA_AN4_MASK                                     0x20
#define _PORTA_OSC2_POSN                                    0x6
#define _PORTA_OSC2_POSITION                                0x6
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x40
#define _PORTA_OSC1_POSN                                    0x7
#define _PORTA_OSC1_POSITION                                0x7
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x80
#define _PORTA_CPSA0_POSN                                   0x1
#define _PORTA_CPSA0_POSITION                               0x1
#define _PORTA_CPSA0_SIZE                                   0x1
#define _PORTA_CPSA0_LENGTH                                 0x1
#define _PORTA_CPSA0_MASK                                   0x2
#define _PORTA_CPSA1_POSN                                   0x2
#define _PORTA_CPSA1_POSITION                               0x2
#define _PORTA_CPSA1_SIZE                                   0x1
#define _PORTA_CPSA1_LENGTH                                 0x1
#define _PORTA_CPSA1_MASK                                   0x4
#define _PORTA_CPSA2_POSN                                   0x3
#define _PORTA_CPSA2_POSITION                               0x3
#define _PORTA_CPSA2_SIZE                                   0x1
#define _PORTA_CPSA2_LENGTH                                 0x1
#define _PORTA_CPSA2_MASK                                   0x8
#define _PORTA_CPSA3_POSN                                   0x4
#define _PORTA_CPSA3_POSITION                               0x4
#define _PORTA_CPSA3_SIZE                                   0x1
#define _PORTA_CPSA3_LENGTH                                 0x1
#define _PORTA_CPSA3_MASK                                   0x10
#define _PORTA_CPSA4_POSN                                   0x5
#define _PORTA_CPSA4_POSITION                               0x5
#define _PORTA_CPSA4_SIZE                                   0x1
#define _PORTA_CPSA4_LENGTH                                 0x1
#define _PORTA_CPSA4_MASK                                   0x20
#define _PORTA_CPSB1_POSN                                   0x6
#define _PORTA_CPSB1_POSITION                               0x6
#define _PORTA_CPSB1_SIZE                                   0x1
#define _PORTA_CPSB1_LENGTH                                 0x1
#define _PORTA_CPSB1_MASK                                   0x40
#define _PORTA_CPSB0_POSN                                   0x7
#define _PORTA_CPSB0_POSITION                               0x7
#define _PORTA_CPSB0_SIZE                                   0x1
#define _PORTA_CPSB0_LENGTH                                 0x1
#define _PORTA_CPSB0_MASK                                   0x80
#define _PORTA_DACOUT_POSN                                  0x2
#define _PORTA_DACOUT_POSITION                              0x2
#define _PORTA_DACOUT_SIZE                                  0x1
#define _PORTA_DACOUT_LENGTH                                0x1
#define _PORTA_DACOUT_MASK                                  0x4
#define _PORTA_T0CKI_POSN                                   0x4
#define _PORTA_T0CKI_POSITION                               0x4
#define _PORTA_T0CKI_SIZE                                   0x1
#define _PORTA_T0CKI_LENGTH                                 0x1
#define _PORTA_T0CKI_MASK                                   0x10
#define _PORTA_CLKOUT_POSN                                  0x6
#define _PORTA_CLKOUT_POSITION                              0x6
#define _PORTA_CLKOUT_SIZE                                  0x1
#define _PORTA_CLKOUT_LENGTH                                0x1
#define _PORTA_CLKOUT_MASK                                  0x40
#define _PORTA_CLKIN_POSN                                   0x7
#define _PORTA_CLKIN_POSITION                               0x7
#define _PORTA_CLKIN_SIZE                                   0x1
#define _PORTA_CLKIN_LENGTH                                 0x1
#define _PORTA_CLKIN_MASK                                   0x80
#define _PORTA_TACKI_POSN                                   0x4
#define _PORTA_TACKI_POSITION                               0x4
#define _PORTA_TACKI_SIZE                                   0x1
#define _PORTA_TACKI_LENGTH                                 0x1
#define _PORTA_TACKI_MASK                                   0x10

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0x006);
#ifndef _LIB_BUILD
asm("PORTB equ 06h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned AN12                   :1;
        unsigned AN10                   :1;
        unsigned AN8                    :1;
        unsigned AN9                    :1;
        unsigned AN11                   :1;
        unsigned AN13                   :1;
    };
    struct {
        unsigned CPSB8                  :1;
        unsigned CPSB9                  :1;
        unsigned CPSB10                 :1;
        unsigned CPSB11                 :1;
        unsigned CPSB12                 :1;
        unsigned CPSB13                 :1;
        unsigned CPSB14                 :1;
        unsigned CPSB15                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2                   :1;
        unsigned                        :1;
        unsigned T1G                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned T3CKI                  :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0x006);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_AN12_POSN                                    0x0
#define _PORTB_AN12_POSITION                                0x0
#define _PORTB_AN12_SIZE                                    0x1
#define _PORTB_AN12_LENGTH                                  0x1
#define _PORTB_AN12_MASK                                    0x1
#define _PORTB_AN10_POSN                                    0x1
#define _PORTB_AN10_POSITION                                0x1
#define _PORTB_AN10_SIZE                                    0x1
#define _PORTB_AN10_LENGTH                                  0x1
#define _PORTB_AN10_MASK                                    0x2
#define _PORTB_AN8_POSN                                     0x2
#define _PORTB_AN8_POSITION                                 0x2
#define _PORTB_AN8_SIZE                                     0x1
#define _PORTB_AN8_LENGTH                                   0x1
#define _PORTB_AN8_MASK                                     0x4
#define _PORTB_AN9_POSN                                     0x3
#define _PORTB_AN9_POSITION                                 0x3
#define _PORTB_AN9_SIZE                                     0x1
#define _PORTB_AN9_LENGTH                                   0x1
#define _PORTB_AN9_MASK                                     0x8
#define _PORTB_AN11_POSN                                    0x4
#define _PORTB_AN11_POSITION                                0x4
#define _PORTB_AN11_SIZE                                    0x1
#define _PORTB_AN11_LENGTH                                  0x1
#define _PORTB_AN11_MASK                                    0x10
#define _PORTB_AN13_POSN                                    0x5
#define _PORTB_AN13_POSITION                                0x5
#define _PORTB_AN13_SIZE                                    0x1
#define _PORTB_AN13_LENGTH                                  0x1
#define _PORTB_AN13_MASK                                    0x20
#define _PORTB_CPSB8_POSN                                   0x0
#define _PORTB_CPSB8_POSITION                               0x0
#define _PORTB_CPSB8_SIZE                                   0x1
#define _PORTB_CPSB8_LENGTH                                 0x1
#define _PORTB_CPSB8_MASK                                   0x1
#define _PORTB_CPSB9_POSN                                   0x1
#define _PORTB_CPSB9_POSITION                               0x1
#define _PORTB_CPSB9_SIZE                                   0x1
#define _PORTB_CPSB9_LENGTH                                 0x1
#define _PORTB_CPSB9_MASK                                   0x2
#define _PORTB_CPSB10_POSN                                  0x2
#define _PORTB_CPSB10_POSITION                              0x2
#define _PORTB_CPSB10_SIZE                                  0x1
#define _PORTB_CPSB10_LENGTH                                0x1
#define _PORTB_CPSB10_MASK                                  0x4
#define _PORTB_CPSB11_POSN                                  0x3
#define _PORTB_CPSB11_POSITION                              0x3
#define _PORTB_CPSB11_SIZE                                  0x1
#define _PORTB_CPSB11_LENGTH                                0x1
#define _PORTB_CPSB11_MASK                                  0x8
#define _PORTB_CPSB12_POSN                                  0x4
#define _PORTB_CPSB12_POSITION                              0x4
#define _PORTB_CPSB12_SIZE                                  0x1
#define _PORTB_CPSB12_LENGTH                                0x1
#define _PORTB_CPSB12_MASK                                  0x10
#define _PORTB_CPSB13_POSN                                  0x5
#define _PORTB_CPSB13_POSITION                              0x5
#define _PORTB_CPSB13_SIZE                                  0x1
#define _PORTB_CPSB13_LENGTH                                0x1
#define _PORTB_CPSB13_MASK                                  0x20
#define _PORTB_CPSB14_POSN                                  0x6
#define _PORTB_CPSB14_POSITION                              0x6
#define _PORTB_CPSB14_SIZE                                  0x1
#define _PORTB_CPSB14_LENGTH                                0x1
#define _PORTB_CPSB14_MASK                                  0x40
#define _PORTB_CPSB15_POSN                                  0x7
#define _PORTB_CPSB15_POSITION                              0x7
#define _PORTB_CPSB15_SIZE                                  0x1
#define _PORTB_CPSB15_LENGTH                                0x1
#define _PORTB_CPSB15_MASK                                  0x80
#define _PORTB_CCP2_POSN                                    0x3
#define _PORTB_CCP2_POSITION                                0x3
#define _PORTB_CCP2_SIZE                                    0x1
#define _PORTB_CCP2_LENGTH                                  0x1
#define _PORTB_CCP2_MASK                                    0x8
#define _PORTB_T1G_POSN                                     0x5
#define _PORTB_T1G_POSITION                                 0x5
#define _PORTB_T1G_SIZE                                     0x1
#define _PORTB_T1G_LENGTH                                   0x1
#define _PORTB_T1G_MASK                                     0x20
#define _PORTB_T3CKI_POSN                                   0x5
#define _PORTB_T3CKI_POSITION                               0x5
#define _PORTB_T3CKI_SIZE                                   0x1
#define _PORTB_T3CKI_LENGTH                                 0x1
#define _PORTB_T3CKI_MASK                                   0x20

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0x007);
#ifndef _LIB_BUILD
asm("PORTC equ 07h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
    struct {
        unsigned CPSB2                  :1;
        unsigned CPSB3                  :1;
        unsigned CPSB4                  :1;
        unsigned                        :2;
        unsigned CPSA9                  :1;
        unsigned CPSA10                 :1;
        unsigned CPSA11                 :1;
    };
    struct {
        unsigned T1OSO                  :1;
        unsigned T1OSI                  :1;
        unsigned TBCKI                  :1;
        unsigned SCK                    :1;
        unsigned SDI                    :1;
        unsigned SDO                    :1;
        unsigned TX                     :1;
        unsigned RX                     :1;
    };
    struct {
        unsigned T1CKI                  :1;
        unsigned CCP2                   :1;
        unsigned CCP1                   :1;
        unsigned SCL                    :1;
        unsigned SDA                    :1;
        unsigned                        :1;
        unsigned CK                     :1;
        unsigned DT                     :1;
    };
} PORTCbits_t;
