MikroElektronika/core_packages/PIC/XC8/def/PIC16LF707/mcu.h
// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0x008);
#ifndef _LIB_BUILD
asm("PORTD equ 08h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
    struct {
        unsigned CPSB5                  :1;
        unsigned CPSB6                  :1;
        unsigned CPSB7                  :1;
        unsigned CPSA8                  :1;
        unsigned CPSA12                 :1;
        unsigned CPSA13                 :1;
        unsigned CPSA14                 :1;
        unsigned CPSA15                 :1;
    };
    struct {
        unsigned T3G                    :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0x008);
// bitfield macros
#define _PORTD_RD0_POSN                                     0x0
#define _PORTD_RD0_POSITION                                 0x0
#define _PORTD_RD0_SIZE                                     0x1
#define _PORTD_RD0_LENGTH                                   0x1
#define _PORTD_RD0_MASK                                     0x1
#define _PORTD_RD1_POSN                                     0x1
#define _PORTD_RD1_POSITION                                 0x1
#define _PORTD_RD1_SIZE                                     0x1
#define _PORTD_RD1_LENGTH                                   0x1
#define _PORTD_RD1_MASK                                     0x2
#define _PORTD_RD2_POSN                                     0x2
#define _PORTD_RD2_POSITION                                 0x2
#define _PORTD_RD2_SIZE                                     0x1
#define _PORTD_RD2_LENGTH                                   0x1
#define _PORTD_RD2_MASK                                     0x4
#define _PORTD_RD3_POSN                                     0x3
#define _PORTD_RD3_POSITION                                 0x3
#define _PORTD_RD3_SIZE                                     0x1
#define _PORTD_RD3_LENGTH                                   0x1
#define _PORTD_RD3_MASK                                     0x8
#define _PORTD_RD4_POSN                                     0x4
#define _PORTD_RD4_POSITION                                 0x4
#define _PORTD_RD4_SIZE                                     0x1
#define _PORTD_RD4_LENGTH                                   0x1
#define _PORTD_RD4_MASK                                     0x10
#define _PORTD_RD5_POSN                                     0x5
#define _PORTD_RD5_POSITION                                 0x5
#define _PORTD_RD5_SIZE                                     0x1
#define _PORTD_RD5_LENGTH                                   0x1
#define _PORTD_RD5_MASK                                     0x20
#define _PORTD_RD6_POSN                                     0x6
#define _PORTD_RD6_POSITION                                 0x6
#define _PORTD_RD6_SIZE                                     0x1
#define _PORTD_RD6_LENGTH                                   0x1
#define _PORTD_RD6_MASK                                     0x40
#define _PORTD_RD7_POSN                                     0x7
#define _PORTD_RD7_POSITION                                 0x7
#define _PORTD_RD7_SIZE                                     0x1
#define _PORTD_RD7_LENGTH                                   0x1
#define _PORTD_RD7_MASK                                     0x80
#define _PORTD_CPSB5_POSN                                   0x0
#define _PORTD_CPSB5_POSITION                               0x0
#define _PORTD_CPSB5_SIZE                                   0x1
#define _PORTD_CPSB5_LENGTH                                 0x1
#define _PORTD_CPSB5_MASK                                   0x1
#define _PORTD_CPSB6_POSN                                   0x1
#define _PORTD_CPSB6_POSITION                               0x1
#define _PORTD_CPSB6_SIZE                                   0x1
#define _PORTD_CPSB6_LENGTH                                 0x1
#define _PORTD_CPSB6_MASK                                   0x2
#define _PORTD_CPSB7_POSN                                   0x2
#define _PORTD_CPSB7_POSITION                               0x2
#define _PORTD_CPSB7_SIZE                                   0x1
#define _PORTD_CPSB7_LENGTH                                 0x1
#define _PORTD_CPSB7_MASK                                   0x4
#define _PORTD_CPSA8_POSN                                   0x3
#define _PORTD_CPSA8_POSITION                               0x3
#define _PORTD_CPSA8_SIZE                                   0x1
#define _PORTD_CPSA8_LENGTH                                 0x1
#define _PORTD_CPSA8_MASK                                   0x8
#define _PORTD_CPSA12_POSN                                  0x4
#define _PORTD_CPSA12_POSITION                              0x4
#define _PORTD_CPSA12_SIZE                                  0x1
#define _PORTD_CPSA12_LENGTH                                0x1
#define _PORTD_CPSA12_MASK                                  0x10
#define _PORTD_CPSA13_POSN                                  0x5
#define _PORTD_CPSA13_POSITION                              0x5
#define _PORTD_CPSA13_SIZE                                  0x1
#define _PORTD_CPSA13_LENGTH                                0x1
#define _PORTD_CPSA13_MASK                                  0x20
#define _PORTD_CPSA14_POSN                                  0x6
#define _PORTD_CPSA14_POSITION                              0x6
#define _PORTD_CPSA14_SIZE                                  0x1
#define _PORTD_CPSA14_LENGTH                                0x1
#define _PORTD_CPSA14_MASK                                  0x40
#define _PORTD_CPSA15_POSN                                  0x7
#define _PORTD_CPSA15_POSITION                              0x7
#define _PORTD_CPSA15_SIZE                                  0x1
#define _PORTD_CPSA15_LENGTH                                0x1
#define _PORTD_CPSA15_MASK                                  0x80
#define _PORTD_T3G_POSN                                     0x0
#define _PORTD_T3G_POSITION                                 0x0
#define _PORTD_T3G_SIZE                                     0x1
#define _PORTD_T3G_LENGTH                                   0x1
#define _PORTD_T3G_MASK                                     0x1

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0x009);
#ifndef _LIB_BUILD
asm("PORTE equ 09h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
    };
    struct {
        unsigned AN5                    :1;
        unsigned AN6                    :1;
        unsigned AN7                    :1;
        unsigned nMCLR                  :1;
    };
    struct {
        unsigned CPSA5                  :1;
        unsigned CPSA6                  :1;
        unsigned CPSA7                  :1;
    };
} PORTEbits_t;
extern volatile PORTEbits_t PORTEbits __at(0x009);
// bitfield macros
#define _PORTE_RE0_POSN                                     0x0
#define _PORTE_RE0_POSITION                                 0x0
#define _PORTE_RE0_SIZE                                     0x1
#define _PORTE_RE0_LENGTH                                   0x1
#define _PORTE_RE0_MASK                                     0x1
#define _PORTE_RE1_POSN                                     0x1
#define _PORTE_RE1_POSITION                                 0x1
#define _PORTE_RE1_SIZE                                     0x1
#define _PORTE_RE1_LENGTH                                   0x1
#define _PORTE_RE1_MASK                                     0x2
#define _PORTE_RE2_POSN                                     0x2
#define _PORTE_RE2_POSITION                                 0x2
#define _PORTE_RE2_SIZE                                     0x1
#define _PORTE_RE2_LENGTH                                   0x1
#define _PORTE_RE2_MASK                                     0x4
#define _PORTE_RE3_POSN                                     0x3
#define _PORTE_RE3_POSITION                                 0x3
#define _PORTE_RE3_SIZE                                     0x1
#define _PORTE_RE3_LENGTH                                   0x1
#define _PORTE_RE3_MASK                                     0x8
#define _PORTE_AN5_POSN                                     0x0
#define _PORTE_AN5_POSITION                                 0x0
#define _PORTE_AN5_SIZE                                     0x1
#define _PORTE_AN5_LENGTH                                   0x1
#define _PORTE_AN5_MASK                                     0x1
#define _PORTE_AN6_POSN                                     0x1
#define _PORTE_AN6_POSITION                                 0x1
#define _PORTE_AN6_SIZE                                     0x1
#define _PORTE_AN6_LENGTH                                   0x1
#define _PORTE_AN6_MASK                                     0x2
#define _PORTE_AN7_POSN                                     0x2
#define _PORTE_AN7_POSITION                                 0x2
#define _PORTE_AN7_SIZE                                     0x1
#define _PORTE_AN7_LENGTH                                   0x1
#define _PORTE_AN7_MASK                                     0x4
#define _PORTE_nMCLR_POSN                                   0x3
#define _PORTE_nMCLR_POSITION                               0x3
#define _PORTE_nMCLR_SIZE                                   0x1
#define _PORTE_nMCLR_LENGTH                                 0x1
#define _PORTE_nMCLR_MASK                                   0x8
#define _PORTE_CPSA5_POSN                                   0x0
#define _PORTE_CPSA5_POSITION                               0x0
#define _PORTE_CPSA5_SIZE                                   0x1
#define _PORTE_CPSA5_LENGTH                                 0x1
#define _PORTE_CPSA5_MASK                                   0x1
#define _PORTE_CPSA6_POSN                                   0x1
#define _PORTE_CPSA6_POSITION                               0x1
#define _PORTE_CPSA6_SIZE                                   0x1
#define _PORTE_CPSA6_LENGTH                                 0x1
#define _PORTE_CPSA6_MASK                                   0x2
#define _PORTE_CPSA7_POSN                                   0x2
#define _PORTE_CPSA7_POSITION                               0x2
#define _PORTE_CPSA7_SIZE                                   0x1
#define _PORTE_CPSA7_LENGTH                                 0x1
#define _PORTE_CPSA7_MASK                                   0x4

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0x00A);
#ifndef _LIB_BUILD
asm("PCLATH equ 0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCLATH                 :5;
    };
} PCLATHbits_t;
extern volatile PCLATHbits_t PCLATHbits __at(0x00A);
// bitfield macros
#define _PCLATH_PCLATH_POSN                                 0x0
#define _PCLATH_PCLATH_POSITION                             0x0
#define _PCLATH_PCLATH_SIZE                                 0x5
#define _PCLATH_PCLATH_LENGTH                               0x5
#define _PCLATH_PCLATH_MASK                                 0x1F

// Register: INTCON
#define INTCON INTCON
extern volatile unsigned char           INTCON              __at(0x00B);
#ifndef _LIB_BUILD
asm("INTCON equ 0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RBIF                   :1;
        unsigned INTF                   :1;
        unsigned TMR0IF                 :1;
        unsigned RBIE                   :1;
        unsigned INTE                   :1;
        unsigned TMR0IE                 :1;
        unsigned PEIE                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned T0IF                   :1;
        unsigned                        :2;
        unsigned T0IE                   :1;
    };
} INTCONbits_t;
extern volatile INTCONbits_t INTCONbits __at(0x00B);
// bitfield macros
#define _INTCON_RBIF_POSN                                   0x0
#define _INTCON_RBIF_POSITION                               0x0
#define _INTCON_RBIF_SIZE                                   0x1
#define _INTCON_RBIF_LENGTH                                 0x1
#define _INTCON_RBIF_MASK                                   0x1
#define _INTCON_INTF_POSN                                   0x1
#define _INTCON_INTF_POSITION                               0x1
#define _INTCON_INTF_SIZE                                   0x1
#define _INTCON_INTF_LENGTH                                 0x1
#define _INTCON_INTF_MASK                                   0x2
#define _INTCON_TMR0IF_POSN                                 0x2
#define _INTCON_TMR0IF_POSITION                             0x2
#define _INTCON_TMR0IF_SIZE                                 0x1
#define _INTCON_TMR0IF_LENGTH                               0x1
#define _INTCON_TMR0IF_MASK                                 0x4
#define _INTCON_RBIE_POSN                                   0x3
#define _INTCON_RBIE_POSITION                               0x3
#define _INTCON_RBIE_SIZE                                   0x1
#define _INTCON_RBIE_LENGTH                                 0x1
#define _INTCON_RBIE_MASK                                   0x8
#define _INTCON_INTE_POSN                                   0x4
#define _INTCON_INTE_POSITION                               0x4
#define _INTCON_INTE_SIZE                                   0x1
#define _INTCON_INTE_LENGTH                                 0x1
#define _INTCON_INTE_MASK                                   0x10
#define _INTCON_TMR0IE_POSN                                 0x5
#define _INTCON_TMR0IE_POSITION                             0x5
#define _INTCON_TMR0IE_SIZE                                 0x1
#define _INTCON_TMR0IE_LENGTH                               0x1
#define _INTCON_TMR0IE_MASK                                 0x20
#define _INTCON_PEIE_POSN                                   0x6
#define _INTCON_PEIE_POSITION                               0x6
#define _INTCON_PEIE_SIZE                                   0x1
#define _INTCON_PEIE_LENGTH                                 0x1
#define _INTCON_PEIE_MASK                                   0x40
#define _INTCON_GIE_POSN                                    0x7
#define _INTCON_GIE_POSITION                                0x7
#define _INTCON_GIE_SIZE                                    0x1
#define _INTCON_GIE_LENGTH                                  0x1
#define _INTCON_GIE_MASK                                    0x80
#define _INTCON_T0IF_POSN                                   0x2
#define _INTCON_T0IF_POSITION                               0x2
#define _INTCON_T0IF_SIZE                                   0x1
#define _INTCON_T0IF_LENGTH                                 0x1
#define _INTCON_T0IF_MASK                                   0x4
#define _INTCON_T0IE_POSN                                   0x5
#define _INTCON_T0IE_POSITION                               0x5
#define _INTCON_T0IE_SIZE                                   0x1
#define _INTCON_T0IE_LENGTH                                 0x1
#define _INTCON_T0IE_MASK                                   0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x00C);
#ifndef _LIB_BUILD
asm("PIR1 equ 0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned CCP1IF                 :1;
        unsigned SSPIF                  :1;
        unsigned TXIF                   :1;
        unsigned RCIF                   :1;
        unsigned ADIF                   :1;
        unsigned TMR1GIF                :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x00C);
// bitfield macros
#define _PIR1_TMR1IF_POSN                                   0x0
#define _PIR1_TMR1IF_POSITION                               0x0
#define _PIR1_TMR1IF_SIZE                                   0x1
#define _PIR1_TMR1IF_LENGTH                                 0x1
#define _PIR1_TMR1IF_MASK                                   0x1
#define _PIR1_TMR2IF_POSN                                   0x1
#define _PIR1_TMR2IF_POSITION                               0x1
#define _PIR1_TMR2IF_SIZE                                   0x1
#define _PIR1_TMR2IF_LENGTH                                 0x1
#define _PIR1_TMR2IF_MASK                                   0x2
#define _PIR1_CCP1IF_POSN                                   0x2
#define _PIR1_CCP1IF_POSITION                               0x2
#define _PIR1_CCP1IF_SIZE                                   0x1
#define _PIR1_CCP1IF_LENGTH                                 0x1
#define _PIR1_CCP1IF_MASK                                   0x4
#define _PIR1_SSPIF_POSN                                    0x3
#define _PIR1_SSPIF_POSITION                                0x3
#define _PIR1_SSPIF_SIZE                                    0x1
#define _PIR1_SSPIF_LENGTH                                  0x1
#define _PIR1_SSPIF_MASK                                    0x8
#define _PIR1_TXIF_POSN                                     0x4
#define _PIR1_TXIF_POSITION                                 0x4
#define _PIR1_TXIF_SIZE                                     0x1
#define _PIR1_TXIF_LENGTH                                   0x1
#define _PIR1_TXIF_MASK                                     0x10
#define _PIR1_RCIF_POSN                                     0x5
#define _PIR1_RCIF_POSITION                                 0x5
#define _PIR1_RCIF_SIZE                                     0x1
#define _PIR1_RCIF_LENGTH                                   0x1
#define _PIR1_RCIF_MASK                                     0x20
#define _PIR1_ADIF_POSN                                     0x6
#define _PIR1_ADIF_POSITION                                 0x6
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x40
#define _PIR1_TMR1GIF_POSN                                  0x7
#define _PIR1_TMR1GIF_POSITION                              0x7
#define _PIR1_TMR1GIF_SIZE                                  0x1
#define _PIR1_TMR1GIF_LENGTH                                0x1
#define _PIR1_TMR1GIF_MASK                                  0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x00D);
#ifndef _LIB_BUILD
asm("PIR2 equ 0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2IF                 :1;
        unsigned                        :3;
        unsigned TMRAIF                 :1;
        unsigned TMRBIF                 :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
    };
} PIR2bits_t;
