MikroElektronika/core_packages/PIC/XC8/def/PIC16LF707/mcu.h
// Register: PMDATH
#define PMDATH PMDATH
extern volatile unsigned char           PMDATH              __at(0x10E);
#ifndef _LIB_BUILD
asm("PMDATH equ 010Eh");
#endif

// Register: PMADRH
#define PMADRH PMADRH
extern volatile unsigned char           PMADRH              __at(0x10F);
#ifndef _LIB_BUILD
asm("PMADRH equ 010Fh");
#endif

// Register: TMRA
#define TMRA TMRA
extern volatile unsigned char           TMRA                __at(0x110);
#ifndef _LIB_BUILD
asm("TMRA equ 0110h");
#endif

// Register: TBCON
#define TBCON TBCON
extern volatile unsigned char           TBCON               __at(0x111);
#ifndef _LIB_BUILD
asm("TBCON equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TBPS                   :3;
        unsigned TBPSA                  :1;
        unsigned TBSE                   :1;
        unsigned TBCS                   :1;
        unsigned                        :1;
        unsigned TMRBON                 :1;
    };
    struct {
        unsigned TBPS0                  :1;
        unsigned TBPS1                  :1;
        unsigned TBPS2                  :1;
    };
    struct {
        unsigned TMRBPS                 :3;
        unsigned TMRBPSA                :1;
        unsigned TMRBSE                 :1;
        unsigned TMRBCS                 :1;
    };
    struct {
        unsigned TMRBPS0                :1;
        unsigned TMRBPS1                :1;
        unsigned TMRBPS2                :1;
    };
} TBCONbits_t;
extern volatile TBCONbits_t TBCONbits __at(0x111);
// bitfield macros
#define _TBCON_TBPS_POSN                                    0x0
#define _TBCON_TBPS_POSITION                                0x0
#define _TBCON_TBPS_SIZE                                    0x3
#define _TBCON_TBPS_LENGTH                                  0x3
#define _TBCON_TBPS_MASK                                    0x7
#define _TBCON_TBPSA_POSN                                   0x3
#define _TBCON_TBPSA_POSITION                               0x3
#define _TBCON_TBPSA_SIZE                                   0x1
#define _TBCON_TBPSA_LENGTH                                 0x1
#define _TBCON_TBPSA_MASK                                   0x8
#define _TBCON_TBSE_POSN                                    0x4
#define _TBCON_TBSE_POSITION                                0x4
#define _TBCON_TBSE_SIZE                                    0x1
#define _TBCON_TBSE_LENGTH                                  0x1
#define _TBCON_TBSE_MASK                                    0x10
#define _TBCON_TBCS_POSN                                    0x5
#define _TBCON_TBCS_POSITION                                0x5
#define _TBCON_TBCS_SIZE                                    0x1
#define _TBCON_TBCS_LENGTH                                  0x1
#define _TBCON_TBCS_MASK                                    0x20
#define _TBCON_TMRBON_POSN                                  0x7
#define _TBCON_TMRBON_POSITION                              0x7
#define _TBCON_TMRBON_SIZE                                  0x1
#define _TBCON_TMRBON_LENGTH                                0x1
#define _TBCON_TMRBON_MASK                                  0x80
#define _TBCON_TBPS0_POSN                                   0x0
#define _TBCON_TBPS0_POSITION                               0x0
#define _TBCON_TBPS0_SIZE                                   0x1
#define _TBCON_TBPS0_LENGTH                                 0x1
#define _TBCON_TBPS0_MASK                                   0x1
#define _TBCON_TBPS1_POSN                                   0x1
#define _TBCON_TBPS1_POSITION                               0x1
#define _TBCON_TBPS1_SIZE                                   0x1
#define _TBCON_TBPS1_LENGTH                                 0x1
#define _TBCON_TBPS1_MASK                                   0x2
#define _TBCON_TBPS2_POSN                                   0x2
#define _TBCON_TBPS2_POSITION                               0x2
#define _TBCON_TBPS2_SIZE                                   0x1
#define _TBCON_TBPS2_LENGTH                                 0x1
#define _TBCON_TBPS2_MASK                                   0x4
#define _TBCON_TMRBPS_POSN                                  0x0
#define _TBCON_TMRBPS_POSITION                              0x0
#define _TBCON_TMRBPS_SIZE                                  0x3
#define _TBCON_TMRBPS_LENGTH                                0x3
#define _TBCON_TMRBPS_MASK                                  0x7
#define _TBCON_TMRBPSA_POSN                                 0x3
#define _TBCON_TMRBPSA_POSITION                             0x3
#define _TBCON_TMRBPSA_SIZE                                 0x1
#define _TBCON_TMRBPSA_LENGTH                               0x1
#define _TBCON_TMRBPSA_MASK                                 0x8
#define _TBCON_TMRBSE_POSN                                  0x4
#define _TBCON_TMRBSE_POSITION                              0x4
#define _TBCON_TMRBSE_SIZE                                  0x1
#define _TBCON_TMRBSE_LENGTH                                0x1
#define _TBCON_TMRBSE_MASK                                  0x10
#define _TBCON_TMRBCS_POSN                                  0x5
#define _TBCON_TMRBCS_POSITION                              0x5
#define _TBCON_TMRBCS_SIZE                                  0x1
#define _TBCON_TMRBCS_LENGTH                                0x1
#define _TBCON_TMRBCS_MASK                                  0x20
#define _TBCON_TMRBPS0_POSN                                 0x0
#define _TBCON_TMRBPS0_POSITION                             0x0
#define _TBCON_TMRBPS0_SIZE                                 0x1
#define _TBCON_TMRBPS0_LENGTH                               0x1
#define _TBCON_TMRBPS0_MASK                                 0x1
#define _TBCON_TMRBPS1_POSN                                 0x1
#define _TBCON_TMRBPS1_POSITION                             0x1
#define _TBCON_TMRBPS1_SIZE                                 0x1
#define _TBCON_TMRBPS1_LENGTH                               0x1
#define _TBCON_TMRBPS1_MASK                                 0x2
#define _TBCON_TMRBPS2_POSN                                 0x2
#define _TBCON_TMRBPS2_POSITION                             0x2
#define _TBCON_TMRBPS2_SIZE                                 0x1
#define _TBCON_TMRBPS2_LENGTH                               0x1
#define _TBCON_TMRBPS2_MASK                                 0x4

