MikroElektronika/core_packages/PIC/XC8/def/PIC16LF707/mcu.h
extern volatile __bit                   RD7                 __at(0x47);	// @ (0x8 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x48);	// @ (0x9 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x4A);	// @ (0x9 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x4B);	// @ (0x9 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// STATUS<RP0>
extern volatile __bit                   RP0                 __at(0x1D);	// @ (0x3 * 8 + 5)
#define                                 RP0_bit             _BIT_ACCESS(STATUS,5)
// STATUS<RP1>
extern volatile __bit                   RP1                 __at(0x1E);	// @ (0x3 * 8 + 6)
#define                                 RP1_bit             _BIT_ACCESS(STATUS,6)
// PORTC<RX>
extern volatile __bit                   RX                  __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 RX_bit              _BIT_ACCESS(PORTC,7)
// RCSTA<RX9>
extern volatile __bit                   RX9                 __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RX9D>
extern volatile __bit                   RX9D                __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA,0)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,3)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,3)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,5)
// SSPSTAT<SMP>
extern volatile __bit                   SMP                 __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSPSTAT,7)
// RCSTA<SPEN>
extern volatile __bit                   SPEN                __at(0xC7);	// @ (0x18 * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RCSTA,7)
// RCSTA<SREN>
extern volatile __bit                   SREN                __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RCSTA,5)
// SSPCON<SSPEN>
extern volatile __bit                   SSPEN               __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSPCON,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x63);	// @ (0xC * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// SSPCON<SSPM0>
extern volatile __bit                   SSPM0               __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSPCON,0)
// SSPCON<SSPM1>
extern volatile __bit                   SSPM1               __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSPCON,1)
// SSPCON<SSPM2>
extern volatile __bit                   SSPM2               __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSPCON,2)
// SSPCON<SSPM3>
extern volatile __bit                   SSPM3               __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSPCON,3)
// SSPCON<SSPOV>
extern volatile __bit                   SSPOV               __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSPCON,6)
// APFCON<SSSEL>
extern volatile __bit                   SSSEL               __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 SSSEL_bit           _BIT_ACCESS(APFCON,1)
// TXSTA<SYNC>
extern volatile __bit                   SYNC                __at(0x4C4);	// @ (0x98 * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TXSTA,4)
// PORTA<T0CKI>
extern volatile __bit                   T0CKI               __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 T0CKI_bit           _BIT_ACCESS(PORTA,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x40D);	// @ (0x81 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x40C);	// @ (0x81 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// PORTC<T1CKI>
extern volatile __bit                   T1CKI               __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 T1CKI_bit           _BIT_ACCESS(PORTC,0)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// PORTB<T1G>
extern volatile __bit                   T1G                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 T1G_bit             _BIT_ACCESS(PORTB,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// PORTC<T1OSI>
extern volatile __bit                   T1OSI               __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 T1OSI_bit           _BIT_ACCESS(PORTC,1)
// PORTC<T1OSO>
extern volatile __bit                   T1OSO               __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 T1OSO_bit           _BIT_ACCESS(PORTC,0)
// T1CON<T1SYNC>
extern volatile __bit                   T1SYNC              __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 T1SYNC_bit          _BIT_ACCESS(T1CON,2)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// PORTB<T3CKI>
extern volatile __bit                   T3CKI               __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 T3CKI_bit           _BIT_ACCESS(PORTB,5)
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 T3CKPS0_bit         _BIT_ACCESS(T3CON,4)
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 T3CKPS1_bit         _BIT_ACCESS(T3CON,5)
// PORTD<T3G>
extern volatile __bit                   T3G                 __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 T3G_bit             _BIT_ACCESS(PORTD,0)
// T3GCON<T3GGO_nDONE>
extern volatile __bit                   T3GGO_nDONE         __at(0x4F3);	// @ (0x9E * 8 + 3)
#define                                 T3GGO_nDONE_bit     _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GPOL>
extern volatile __bit                   T3GPOL              __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 T3GPOL_bit          _BIT_ACCESS(T3GCON,6)
// T3GCON<T3GSPM>
extern volatile __bit                   T3GSPM              __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 T3GSPM_bit          _BIT_ACCESS(T3GCON,4)
// T3GCON<T3GSS0>
extern volatile __bit                   T3GSS0              __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 T3GSS0_bit          _BIT_ACCESS(T3GCON,0)
// T3GCON<T3GSS1>
extern volatile __bit                   T3GSS1              __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 T3GSS1_bit          _BIT_ACCESS(T3GCON,1)
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 T3GTM_bit           _BIT_ACCESS(T3GCON,5)
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 T3GVAL_bit          _BIT_ACCESS(T3GCON,2)
// T3CON<T3SYNC>
extern volatile __bit                   T3SYNC              __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 T3SYNC_bit          _BIT_ACCESS(T3CON,2)
// PORTA<TACKI>
extern volatile __bit                   TACKI               __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 TACKI_bit           _BIT_ACCESS(PORTA,4)
// TACON<TACS>
extern volatile __bit                   TACS                __at(0x82D);	// @ (0x105 * 8 + 5)
#define                                 TACS_bit            _BIT_ACCESS(TACON,5)
// TACON<TAPS0>
extern volatile __bit                   TAPS0               __at(0x828);	// @ (0x105 * 8 + 0)
#define                                 TAPS0_bit           _BIT_ACCESS(TACON,0)
// TACON<TAPS1>
extern volatile __bit                   TAPS1               __at(0x829);	// @ (0x105 * 8 + 1)
#define                                 TAPS1_bit           _BIT_ACCESS(TACON,1)
// TACON<TAPS2>
extern volatile __bit                   TAPS2               __at(0x82A);	// @ (0x105 * 8 + 2)
#define                                 TAPS2_bit           _BIT_ACCESS(TACON,2)
// TACON<TAPSA>
extern volatile __bit                   TAPSA               __at(0x82B);	// @ (0x105 * 8 + 3)
#define                                 TAPSA_bit           _BIT_ACCESS(TACON,3)
// TACON<TASE>
extern volatile __bit                   TASE                __at(0x82C);	// @ (0x105 * 8 + 4)
#define                                 TASE_bit            _BIT_ACCESS(TACON,4)
// CPSACON0<TAXCS>
extern volatile __bit                   TAXCS               __at(0x840);	// @ (0x108 * 8 + 0)
#define                                 TAXCS_bit           _BIT_ACCESS(CPSACON0,0)
// PORTC<TBCKI>
extern volatile __bit                   TBCKI               __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 TBCKI_bit           _BIT_ACCESS(PORTC,2)
// TBCON<TBCS>
extern volatile __bit                   TBCS                __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 TBCS_bit            _BIT_ACCESS(TBCON,5)
// TBCON<TBPS0>
extern volatile __bit                   TBPS0               __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 TBPS0_bit           _BIT_ACCESS(TBCON,0)
// TBCON<TBPS1>
extern volatile __bit                   TBPS1               __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 TBPS1_bit           _BIT_ACCESS(TBCON,1)
// TBCON<TBPS2>
extern volatile __bit                   TBPS2               __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 TBPS2_bit           _BIT_ACCESS(TBCON,2)
// TBCON<TBPSA>
extern volatile __bit                   TBPSA               __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 TBPSA_bit           _BIT_ACCESS(TBCON,3)
// TBCON<TBSE>
extern volatile __bit                   TBSE                __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 TBSE_bit            _BIT_ACCESS(TBCON,4)
// CPSBCON0<TBXCS>
extern volatile __bit                   TBXCS               __at(0x830);	// @ (0x106 * 8 + 0)
#define                                 TBXCS_bit           _BIT_ACCESS(CPSBCON0,0)
// OPTION_REG<TMR0CS>
extern volatile __bit                   TMR0CS              __at(0x40D);	// @ (0x81 * 8 + 5)
#define                                 TMR0CS_bit          _BIT_ACCESS(OPTION_REG,5)
// INTCON<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(INTCON,5)
// INTCON<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 TMR0IF_bit          _BIT_ACCESS(INTCON,2)
// OPTION_REG<TMR0SE>
extern volatile __bit                   TMR0SE              __at(0x40C);	// @ (0x81 * 8 + 4)
#define                                 TMR0SE_bit          _BIT_ACCESS(OPTION_REG,4)
// T1GCON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0x47F);	// @ (0x8F * 8 + 7)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1GCON,7)
// PIE1<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x67);	// @ (0xC * 8 + 7)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR1,7)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x60);	// @ (0xC * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE1<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE1,1)
// PIR1<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x61);	// @ (0xC * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR1,1)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,2)
// T3CON<TMR3CS0>
extern volatile __bit                   TMR3CS0             __at(0x4BE);	// @ (0x97 * 8 + 6)
#define                                 TMR3CS0_bit         _BIT_ACCESS(T3CON,6)
// T3CON<TMR3CS1>
extern volatile __bit                   TMR3CS1             __at(0x4BF);	// @ (0x97 * 8 + 7)
#define                                 TMR3CS1_bit         _BIT_ACCESS(T3CON,7)
// T3GCON<TMR3GE>
extern volatile __bit                   TMR3GE              __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 TMR3GE_bit          _BIT_ACCESS(T3GCON,7)
// PIE2<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x46F);	// @ (0x8D * 8 + 7)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE2,7)
// PIR2<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR2,7)
// PIE2<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x46E);	// @ (0x8D * 8 + 6)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR2,6)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// TACON<TMRACS>
extern volatile __bit                   TMRACS              __at(0x82D);	// @ (0x105 * 8 + 5)
#define                                 TMRACS_bit          _BIT_ACCESS(TACON,5)
// PIE2<TMRAIE>
extern volatile __bit                   TMRAIE              __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 TMRAIE_bit          _BIT_ACCESS(PIE2,4)
// PIR2<TMRAIF>
extern volatile __bit                   TMRAIF              __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 TMRAIF_bit          _BIT_ACCESS(PIR2,4)
// TACON<TMRAON>
extern volatile __bit                   TMRAON              __at(0x82F);	// @ (0x105 * 8 + 7)
#define                                 TMRAON_bit          _BIT_ACCESS(TACON,7)
// TACON<TMRAPS0>
extern volatile __bit                   TMRAPS0             __at(0x828);	// @ (0x105 * 8 + 0)
#define                                 TMRAPS0_bit         _BIT_ACCESS(TACON,0)
// TACON<TMRAPS1>
extern volatile __bit                   TMRAPS1             __at(0x829);	// @ (0x105 * 8 + 1)
#define                                 TMRAPS1_bit         _BIT_ACCESS(TACON,1)
// TACON<TMRAPS2>
extern volatile __bit                   TMRAPS2             __at(0x82A);	// @ (0x105 * 8 + 2)
#define                                 TMRAPS2_bit         _BIT_ACCESS(TACON,2)
// TACON<TMRAPSA>
extern volatile __bit                   TMRAPSA             __at(0x82B);	// @ (0x105 * 8 + 3)
#define                                 TMRAPSA_bit         _BIT_ACCESS(TACON,3)
// TACON<TMRASE>
extern volatile __bit                   TMRASE              __at(0x82C);	// @ (0x105 * 8 + 4)
#define                                 TMRASE_bit          _BIT_ACCESS(TACON,4)
// TBCON<TMRBCS>
extern volatile __bit                   TMRBCS              __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 TMRBCS_bit          _BIT_ACCESS(TBCON,5)
// PIE2<TMRBIE>
extern volatile __bit                   TMRBIE              __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 TMRBIE_bit          _BIT_ACCESS(PIE2,5)
// PIR2<TMRBIF>
extern volatile __bit                   TMRBIF              __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 TMRBIF_bit          _BIT_ACCESS(PIR2,5)
// TBCON<TMRBON>
extern volatile __bit                   TMRBON              __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 TMRBON_bit          _BIT_ACCESS(TBCON,7)
// TBCON<TMRBPS0>
extern volatile __bit                   TMRBPS0             __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 TMRBPS0_bit         _BIT_ACCESS(TBCON,0)
// TBCON<TMRBPS1>
extern volatile __bit                   TMRBPS1             __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 TMRBPS1_bit         _BIT_ACCESS(TBCON,1)
// TBCON<TMRBPS2>
extern volatile __bit                   TMRBPS2             __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 TMRBPS2_bit         _BIT_ACCESS(TBCON,2)
// TBCON<TMRBPSA>
extern volatile __bit                   TMRBPSA             __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 TMRBPSA_bit         _BIT_ACCESS(TBCON,3)
// TBCON<TMRBSE>
extern volatile __bit                   TMRBSE              __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 TMRBSE_bit          _BIT_ACCESS(TBCON,4)
// T1CON<TMRCS0>
extern volatile __bit                   TMRCS0              __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 TMRCS0_bit          _BIT_ACCESS(T1CON,6)
// T1CON<TMRCS1>
extern volatile __bit                   TMRCS1              __at(0x87);	// @ (0x10 * 8 + 7)
#define                                 TMRCS1_bit          _BIT_ACCESS(T1CON,7)
// T2CON<TOUTPS0>
extern volatile __bit                   TOUTPS0             __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 TOUTPS0_bit         _BIT_ACCESS(T2CON,3)
// T2CON<TOUTPS1>
extern volatile __bit                   TOUTPS1             __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 TOUTPS1_bit         _BIT_ACCESS(T2CON,4)
// T2CON<TOUTPS2>
extern volatile __bit                   TOUTPS2             __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 TOUTPS2_bit         _BIT_ACCESS(T2CON,5)
// T2CON<TOUTPS3>
extern volatile __bit                   TOUTPS3             __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 TOUTPS3_bit         _BIT_ACCESS(T2CON,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x429);	// @ (0x85 * 8 + 1)
